app/controllers/api/pokemon_controller.rb

	def index
		sleep 1
		@pokemon = Pokemon.all
---
SELECT "pokemons".* FROM "pokemons"

	def show
		sleep 1
		@pokemon = Pokemon.find(params[:id])
---
SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = $1 LIMIT 1  [["id", 5]]